mctainsh/Arduino/ESP32/HomeSpanV6/DEV_Base.h
#include "assert.h"
#pragma once

#include "esp32-hal.h"
#include "Arduino.h"
#include "Globals.h"

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Dimable and colour changing
struct DEV_Base : Service::LightBulb
{
	SpanCharacteristic *POWER;	// reference to the On Characteristic
	SpanCharacteristic *V;		// reference to the Brightness Characteristic

	bool _powerOn = false;
	float _powerLevel = 50;

	unsigned long _timeOfPowerChange;
	bool _changeComplete = true;

	DEV_Base()
	  : Service::LightBulb()
	{
	}

	virtual void Show(bool startup = true)
	{
		assert(0);
	}

	bool PoweringOn()
	{
		return _powerOn && !_changeComplete;
	}

	bool PoweringOff()
	{
		return !_powerOn && !_changeComplete;
	}
	void PowerDown()
	{
		_changeComplete = true;
		_powerOn = false;
		POWER->setVal(false);
	}

	/////////////////////////////////////////////////////////////////////////////
	// Get the powerlevel for the
	void SetPowerlevel()
	{
		// Has a change started
		if (_changeComplete)
			return;

		unsigned long age = millis() - _timeOfPowerChange;

		// Apply the new level value
		float brightness;
		if (_powerOn)
			brightness = _min(_powerLevel, MAX_BRIGHTNESS * (age / POWER_FADE_MS));
		else
			brightness = _max(0, MAX_BRIGHTNESS - MAX_BRIGHTNESS * (age / POWER_FADE_MS));

		g_strip.setBrightness(brightness);

		// Is the change complete
		if (age > POWER_FADE_MS)
		{
			_changeComplete = true;
			TurnOnStrip(_powerOn);
		}

		Show();
	}

	////////////////////////////////////////////////////////////////////////
	// Read the base setting
	void UpdateBase()
	{
		_powerOn = POWER->getVal();
		_powerLevel = V->getVal();
		if (POWER->updated())
		{
			_powerOn = POWER->getNewVal();
			_timeOfPowerChange = millis();
			_changeComplete = false;
		}

		if (V->updated())
		{
			_powerLevel = V->getNewVal();
			_changeComplete = false;
		}
	}
};
